{
    "decimals": 8,
    "icon": "/images/tokens/JOE.png",
    "id": "0.0.1302480",
    "name": "JOE",
    "price": "0",
    "priceUsd": 0,
    "symbol": "JOE[hts]",
    "dueDiligenceComplete": true,
    "isFeeOnTransferToken": false,
    "description": "JOE (JOE) is the native token of Trader Joe, a decentralized exchange (DEX) on the Avalanche (AVAX) blockchain that offers DeFi services, including swapping, staking and yield farming.\n\nTrader Joe v1 has been built on the popular x*y=k Automated Market Maker (AMM) design that saw exponential growth and adoption across DeFi. Trader Joe v1 offers users an accessible and convenient way to provide passive liquidity and trade tokens. However, this protocol design does have drawbacks, such as capital inefficiencies and high risks of impermanent loss.\n\nTrader Joe v2 uses a new protocol: Liquidity Book. One of the key changes that the Liquidity Book protocol implements is concentrated liquidity. This way of stacking liquidity offers vast improvements over the traditional AMM models by being very capital efficient. Users can choose what prices they want to provide liquidity for instead of utilising the 0 to infinity range. The Liquidity Book design allows LPs to easily develop custom strategies matching their own goals and risk profile. Instead of having one pool with unbound price ranges, Liquidity Book has multiple separate bins with different prices that can be used as building blocks for a liquidity position. Those looking to capture maximum fees and willing to take some risk can deposit all their tokens into one bin. Others can choose a more balanced approach with bespoke liquidity structures.\n\nNote: the [hts] subscript denotes that this asset has been bridged through hashport.",
    "website": "https://traderjoexyz.com/#/home",
    "sentinelReport": null,
    "twitterHandle": "traderjoe_xyz",
    "timestampSecondsLastListingChange": 0,
    "cmc_id": 11396,
    "token_name": "JOE",
    "type": "HEDERA",
    "cmc_rank": 200
}